;---------------------------------BEGIN: Bin\CardDrv\MultiLevelCali---------------------------
[MULTILEVELCALI_STRINGTABLE]
ID1000=BOX大小
ID1001=X縮放
ID1002=Y縮放
ID1003=X凹凸
ID1004=Y凹凸
ID1005=X梯形
ID1006=Y梯形
ID1007=X平行
ID1008=Y平行
ID1011=X軸正向,Y軸正向
ID1012=X軸正向,Y軸正向,XY軸互換
ID1013=X軸正向,Y軸反向
ID1014=X軸正向,Y軸反向,XY軸互換
ID1015=X軸反向,Y軸正向
ID1016=X軸反向,Y軸正向,XY軸互換
ID1017=X軸反向,Y軸反向
ID1018=X軸反向,Y軸反向,XY軸互換
ID1019=校正範圍不能為0
ID1020=打標範圍不能為0
ID1021=校正範圍和打標範圍的比例係數不對，校正範圍必須是打標範圍的%.3f倍上！
ID1022=應用
ID1023=修改
ID1024=請選擇要刪除級別
ID1025=刪除失敗！請至少保留一級校正
ID1026=級別校正配置檔(*.dat)|*.dat||
ID1027=導入失敗，檔已損壞不可用
ID1028=導出失敗，請稍後再試
ID1029=保存校正配置檔失敗， 請稍後再試
ID1030=保存校正資料檔案失敗， 請稍後再試
ID1031=BOX大小不能超出打標範圍！
ID1032=BOX大小不能超出上一級大小
ID1033=BOX大小不能為0
ID1034=操作失敗，請稍後再試
ID1035=X正向比例
ID1036=X負向比例
ID1037=Y正向比例
ID1038=Y負向比例
ID1039=請先選擇要測試的校正級別!

[MULTILEVELCALI_DLG_4002]
CAPTION=高級
ID4022=X正向大小(mm):
ID4023=X負向大小(mm):
ID4024=Y正向大小(mm):
ID4025=Y負向大小(mm):
ID1=確定
ID2=取消

[MULTILEVELCALI_DLG_4000]
CAPTION=多級校正
ID4026=基本設置
ID4027=範圍
ID4028=校正範圍(mm)
ID4029=打標範圍(mm)
ID4030=相對中心點
ID4031=X座標偏移量(mm)
ID4032=Y座標偏移量(mm)
ID4033=自定義坐標系
ID4034=選擇
ID4009=應用/修改
ID4035=級別校正
ID4012=插入新級別
ID4013=刪除選定級別
ID4014=導入(&I)
ID4015=導出(&E)
ID4037=打標測試(&T)
ID4038=保存(&S)
ID4039=測試參數
ID1=確定
ID2=取消

[MULTILEVELCALI_DLG_4004]
CAPTION=測試參數
ID4040=打標次數
ID4041=打標速度(mm/s)
ID4042=Q頻(KHz)
ID4043=電流(A)
ID1=確定
ID2=取消

[MULTILEVELCALI_DLG_4005]
CAPTION=測試參數
ID4040=打標次數
ID4041=打標速度(mm/s)
ID4042=Q頻(KHz)
ID4043=功率(%)
ID1=確定
ID2=取消

;---------------------------------END: Bin\CardDrv\MultiLevelCali------------------------------

;---------------------------------BEGIN: Bin\SystemSet-----------------------------------------
[SYSTEMSET_DLG_1000]
CAPTION=系統設置
ID1000=導入
ID1001=導出
ID1=確定
ID2=取消

[SYSTEMSET_STRINGTABLE]
TRIGGER_SIGNAL=觸發信號
Trig_Hold_Times=每幾次觸發一次$$
Mark_Repeat=觸發後打標次數$$
Delay_After_Trig=觸發後延時(ms)$$
Mark_Interval=每次打標之間時間間隔(ms)$$
Delay_After_Done=打標完成後延時(ms)$$
Is_Mark_Once=不在同一物體上多次打標$true|false$

RED_SETTING=紅光設置
Red_Locate_Speed=紅光定位速度(mm/s)
Frm_Locate_Speed=邊框定位速度(mm/s)

SAFEDOOR_SETTING=安全門設置
Is_Enable=是否啟用安全門控制
Ctrl_Mode=控制方式$暫停打標|停止打標$

LASER_SETTING=雷射器
Laser_GENERAL_S=通用雷射器(ADJUST_Q/CO2/LD)
Min_Occuppy_G=最小占空比(0.0~1.0)
Max_Occuppy_G=最大占空比(0.0~1.0)
SimmerP_Freq_G=維持脈衝頻率(KHZ)
SimmerP_RelTime_G=維持脈衝時間(us)
Free_Current_G=空閒電流(A)
Laser_FIBER_S=光纖雷射器(SPI)
SimmerP_Freq_F=維持脈衝頻率(KHZ)

CARD_SETTING=控制卡
MARK_END_DELAY=打標完成信號時長(ms)

;---------------------------------END: Bin\SystemSet-------------------------------------------

;---------------------------------BEGIN: Bin\DogMgr-----------------------------------------
[DOGMGR_DLG_3000]
CAPTION=啟動綁定
ID1033=請輸入12位啟動碼:
ID1=確定
ID2=取消

[DOGMGR_STRINGTABLE]
ID1000=打標軟體錯誤，請重新安裝!
ID1015=沒有檢測到軟體狗!
ID1016=檢測到軟體狗，但不是合法的軟體狗!
ID1017=插入的合法軟體狗多於1個!
ID1018=將初始狗轉換成運行狗失敗!
ID1019="當前軟體授權已到期，需要聯繫大族客服人員，重新申請與（狗ID=%s，校驗碼=%s）匹配的許可授權補丁，以便繼續使用"
ID1020="軟體授權還允許運行%d天，需要聯繫大族客服人員，重新申請與（狗ID=%s，校驗碼=%s）匹配的許可授權補丁，以便到期後能繼續使用"
ID1021="設備已連續運行一年，需要聯繫大族客服人員，對設備進行維護檢修，以確保安全正常運行，並申請與（狗ID=%s，校驗碼=%s）匹配的軟體授權檢修確認補丁"
ID1022=軟體狗類型不匹配，請確認軟體狗是否是該打標卡配套的軟體狗，否則請聯繫大族客服人員！
ID1023=獲取打標卡綁定ID失敗，請檢查打標卡是否正常！
ID1024=打標卡綁定到軟體狗失敗，請檢查打標卡是否正常！
ID1025=打標卡成功綁定到軟體狗！
ID1026=當前軟體狗和打標卡不配套，請重新啟動軟體狗以建立和卡的綁定關係！
ID1027="請輸入%d年發佈的與軟體狗ID(%s)，啟動校驗碼(%s)匹配的第%d次啟動碼："
ID1028=未啟動軟體狗與打標卡的綁定關係！
ID1029=啟動碼校驗檢測失敗，請重試！
ID1030="啟動碼校驗檢測成功，下一有效啟動索引(%d)，啟動校驗碼為(%s)"
ID1031=啟動碼校驗檢測失敗，啟動碼不正確！
ID1032=打標卡成功綁定到軟體狗！
ID1033=軟體狗類型不匹配，請確認軟體狗是否是打標軟體配套的軟體狗，否則請聯繫大族客服人員！

;---------------------------------END: Bin\DogMgr-----------------------------------------

;---------------------------------BEGIN: Bin\CardApp\HLDown-----------------------------------------
[HLDOWN_DLG_2000]
CAPTION=文檔下載管理
ID2000=IO有效位
ID1016=退出時切換成脫機模式
ID1013=IO屬性
ID1014=下載
ID1015=開始/停止打標
ID1018=多文檔保存
ID1=退出

[HLDOWN_DLG_2001]
CAPTION=設置IO
ID2001=獲取當前信號
ID1=確定
ID2=取消

[HLDOWN_STRINGTABLE]
ID0=選擇
ID1=檔案名
ID2=IO有效位
ID3=IO託管值
ID4=下載標誌
ID1000=請選擇要下載文檔!
ID1001=卡現有的文檔將會被擦出,確認下載嗎?
ID1002=下載失敗,請重試!
ID1003=下載結果:
ID1004=下位機存儲空間的 %d%% 已經被佔用
ID1005=請選擇要設置託管IO的文檔!
ID1006=請選擇要打標的文檔!
ID1007=不能存在相同的託管值!
ID1008=已下載
ID1009=未下載
ID1010=開始打標
ID1011=停止打標
ID2000=成功下載
ID2001=檔傳輸失敗
ID2002=檔太大，超過flash範圍
ID2003=flash寫入錯誤
ID2004=文檔數據未準備好
ID2005=文檔資料超出打標範圍
ID2006=IO有效位未設定

;---------------------------------END: Bin\CardApp\HLDown-----------------------------------------

;---------------------------------BEGIN: Bin\HLIOCheck-----------------------------------------
[HLIOCHECK_DLG_3000]
CAPTION=IO信號檢測
ID1012=輸入
ID1013=輸出
;---------------------------------END: Bin\HLIOCheck-----------------------------------------

;---------------------------------BEGIN: Bin\GraySet-----------------------------------------
[GRAYSET_DLG_1002]
CAPTION=灰度設置
ID1004=方案集
ID1842=另存為
ID1403=刪除
ID1005=控制模式:
ID1006=線性
ID1007=調整級數
ID1838=白底
ID1001=復位
ID1008=打標測試
ID1837=全部灰度
ID1841=指定灰度
ID1009=灰度級:
ID1010=打標速度:
ID1011=點間距
ID1015=最小調節功率(%):
ID1016=最大調節功率(%):
ID1=確定
ID2=取消

[GRAYSET_DLG_1003]
CAPTION=保存方案
ID1012=參數方案另存為:
ID1=確定
ID2=取消

[GRAYSET_STRINGTABLE]
ID1001=不能打開該方案!
ID1002=請選擇要刪除的方案
ID1003=缺省方案不能刪除
ID1004=確認刪除
ID1005=刪除失敗
ID1006=缺省方案不能被覆蓋保存
ID1007=已經存在同名方案，確定覆蓋?
ID1008=增加方案出錯
ID1009=占空比
ID1010=Q調節
ID1011=電流
ID1012=直線
ID1013=曲線
ID1014=灰度級
ID1015=灰度色
ID1016=能量(%)
ID1017=IPG雷射器暫不支持灰度調節!
ID1018=功率
ID1019=調頻

;---------------------------------END: Bin\GraySet-----------------------------------------

;---------------------------------BEGIN: HANSADVINTERFACE-----------------------------------------
[HANSADVINTERFACE_STRINGTABLE]
ID1=另一個程式在運行          
ID2=路徑不正確             
ID3=初始化失敗             
ID4=未初始化              
ID5=報警
ID6=命令超時              
ID7=無法讀取文件            
ID8=指定的字體不存在          
ID9=指定的層號不存在          
ID10=沒找到指定的對象          
ID11=參數非法              
ID12=錯誤的狀態,當前狀態下不能執行此操作
ID13=分配記憶體失敗            
ID14=超出系統打標範圍          
ID15=緩衝區不夠             
ID16=空指針               
ID17=未找到指定文檔
ID18=命令執行失敗
ID100=未知錯誤

;---------------------------------END: HANSADVINTERFACE-----------------------------------------

